Repository: huybnd-1817/agentic-coding-hands-on
Catalog: saa/Resources/Localizable.xcstrings
Source language: vi
Languages: en

# accessDenied.message
source: Bạn không có quyền truy cập nội dung này.
en: You do not have permission to access this content.

# accessDenied.signOut
source: Đăng xuất
en: Sign Out

# accessDenied.title
source: Truy cập bị từ chối
en: Access Denied

# home.awards.details
source: Chi tiết
en: Details

# home.awards.empty
source: Chưa có giải thưởng nào
en: No awards available yet

# home.awards.error
source: Không tải được danh sách giải thưởng
en: Failed to load awards

# home.awards.retry
source: Thử lại
en: Retry

# home.awards.sectionTitle
source: Hệ thống giải thưởng
en: Awards System

# home.button.logout
source: Đăng xuất
en: Logout

# home.greeting
source: Xin chào, %@
en: Hello, %@

# home.header.notifications.accessibility
source: Thông báo
en: Notifications

# home.header.search.accessibility
source: Tìm kiếm
en: Search

# home.hero.aboutAward
source: Về giải thưởng này
en: About this Award

# home.hero.aboutKudos
source: Về Kudos
en: About Kudos

# home.hero.comingSoon
source: Sắp ra mắt
en: Coming soon

# home.hero.dateLabel
source: Thời gian:
en: Time:

# home.hero.days
source: NGÀY
en: DAYS

# home.hero.hours
source: GIỜ
en: HOURS

# home.hero.livestreamNote
source: Tường thuật trực tiếp tại Group Facebook Sun* Family
en: Live broadcast on the Sun* Family Facebook Group

# home.hero.minutes
source: PHÚT
en: MINUTES

# home.hero.venueLabel
source: Địa điểm:
en: Venue:

# home.kudos.body
source: ĐIỂM MỚI CỦA SAA 2025 Hoạt động ghi nhận và cảm ơn đồng nghiệp - lần đầu tiên được diễn ra dành cho tất cả Sunner. Hoạt động sẽ được triển khai vào tháng 11/2025, khuyến khích người Sun* chia sẻ những lời ghi nhận, cảm ơn đồng nghiệp trên hệ thống do BTC công bố. Đây sẽ là chất liệu để Hội đồng Heads tham khảo trong quá trình lựa chọn người đạt giải.
en: NEW FOR SAA 2025 A company-wide recognition and thank-you program — running for the first time and open to every Sunner. Launching in November 2025, it encourages people to share appreciation for colleagues through the official platform. These submissions become reference material for the Heads council during the awards selection.

# home.kudos.details
source: Chi tiết
en: Details

# home.kudos.eyebrow
source: Phong trào ghi nhận
en: Recognition movement

# home.kudos.newBadge
source: Mới
en: New

# home.language.title
source: Ngôn ngữ
en: Language

# home.nav.awards
source: Giải thưởng
en: Awards

# home.nav.profile
source: Hồ sơ
en: Profile

# home.stub.awardDetail
source: Chi tiết giải thưởng
en: Award Detail

# home.stub.awardsOverview
source: Tổng quan giải thưởng
en: Awards Overview

# home.stub.comingSoon
source: Sắp ra mắt
en: Coming soon

# home.stub.kudosDetail
source: Chi tiết Kudos
en: Kudos Detail

# home.stub.kudosFeed
source: Bảng tin Kudos
en: Kudos Feed

# home.stub.kudosOverview
source: Tổng quan Kudos
en: Kudos Overview

# home.stub.notifications
source: Thông báo
en: Notifications

# home.stub.search
source: Tìm kiếm
en: Search

# home.stub.writeKudo
source: Viết một Kudo
en: Write a Kudo

# home.theme.body
source: Không đơn thuần là một cái tên, “Root Further” chính là tinh thần mà mỗi người Sun* đang hướng tới: luôn nhìn nhận sâu sắc trong mọi bối cảnh và không ngừng sáng tạo, mở rộng bản thân để vượt qua những giới hạn mà chính mình đã từng đặt ra. Mượn hình ảnh ẩn dụ của lý thuyết phối màu, chỉ từ ba màu cơ bản: đỏ, vàng và lam, sức sáng tạo vô tận của mỗi cá nhân có thể tạo ra số lượng màu sắc gần như vô hạn, với mỗi gam màu đều đại diện cho sự bứt phá và sáng tạo không giới hạn.
en: More than a name, "Root Further" is the spirit every Sunner aspires to: looking deeply at every context and never stopping creativity, expanding ourselves past the limits we once set. Borrowing the metaphor of color theory — from only three primary colors (red, yellow, blue) limitless individual creativity can generate an almost infinite spectrum, with each shade standing for a breakthrough and boundless creation.

# kudos.allKudos.title
source: Tất cả Kudos
en: All Kudos

# kudos.anonymous.fallback
source: Ẩn danh
en: Anonymous

# kudos.anonymousSender.label
source: Người gửi ẩn danh
en: Anonymous sender

# kudos.card.viewDetail
source: Xem chi tiết
en: View details

# kudos.create.action.cancel
source: Hủy
en: Cancel

# kudos.create.action.send
source: Gửi đi
en: Send

# kudos.create.anonymous.nickname.label
source: Nickname ẩn danh
en: Anonymous nickname

# kudos.create.anonymous.nickname.placeholder
source: Nhập biệt danh…
en: Enter a nickname…

# kudos.create.anonymous.toggle
source: Gửi lời cám ơn và ghi nhận ẩn danh
en: Send recognition anonymously

# kudos.create.cancel.confirm.body
source: Nội dung chưa lưu sẽ bị mất.
en: Unsaved content will be lost.

# kudos.create.cancel.confirm.discard
source: Hủy lời chúc
en: Discard

# kudos.create.cancel.confirm.keep
source: Tiếp tục
en: Continue editing

# kudos.create.cancel.confirm.title
source: Hủy lời chúc?
en: Discard kudos?

# kudos.create.error.cannotSendToSelf
source: Không thể gửi Kudos cho chính mình.
en: You cannot send a kudo to yourself.

# kudos.create.error.hashtagsRequired
source: Vui lòng thêm ít nhất 1 hashtag.
en: Please add at least one hashtag.

# kudos.create.error.hashtagsTooMany
source: Tối đa 5 hashtag.
en: Maximum 5 hashtags allowed.

# kudos.create.error.imagesTooMany
source: Tối đa 5 hình ảnh.
en: Maximum 5 images.

# kudos.create.error.imageTooLarge
source: Hình ảnh vượt quá 5MB.
en: Image exceeds 5MB.

# kudos.create.error.messageRequired
source: Vui lòng viết lời ghi nhận.
en: Please write your recognition message.

# kudos.create.error.messageTooLong
source: Vượt giới hạn ký tự. Vui lòng rút gọn.
en: Character limit reached. Please shorten your message.

# kudos.create.error.messageWhitespaceOnly
source: Nội dung không được để trống.
en: Message cannot be empty.

# kudos.create.error.nicknameRequired
source: Vui lòng nhập biệt danh.
en: Please enter a nickname.

# kudos.create.error.nicknameTooLong
source: Biệt danh quá dài (tối đa 30 ký tự).
en: Nickname is too long (max 30 characters).

# kudos.create.error.recipientRequired
source: Vui lòng chọn người nhận.
en: Please select a recipient.

# kudos.create.error.requiredFields
source: Bạn cần điền đủ Người nhận, Lời nhắn gửi và Hashtag để gửi Kudos!
en: Please fill in Recipient, Message and Hashtag to send Kudos!

# kudos.create.error.titleRequired
source: Vui lòng nhập danh hiệu.
en: Please enter a title for this recognition.

# kudos.create.error.titleTooLong
source: Danh hiệu quá dài (tối đa 100 ký tự).
en: Title is too long (max 100 characters).

# kudos.create.error.unsupportedImageType
source: Định dạng không được hỗ trợ (chỉ JPEG/PNG).
en: Unsupported format (JPEG/PNG only).

# kudos.create.hashtag.add
source: + Hashtag (Tối đa 5)
en: + Hashtag (Max 5)

# kudos.create.header
source: Gửi lời cám ơn và ghi nhận đến đồng đội
en: Send thanks and recognition to your teammates

# kudos.create.image.add
source: + Image (Tối đa 5)
en: + Image (Max 5)

# kudos.create.message.hint
source: Bạn có thể "@ + tên" để nhắc tới đồng nghiệp khác
en: You can use "@ + name" to mention another colleague

# kudos.create.message.placeholder
source: Hãy gửi gắm lời cám ơn và ghi nhận đến đồng đội tại đây nhé!
en: Share your thanks and recognition with your teammates here!

# kudos.create.recipient.empty
source: Không tìm thấy
en: No results

# kudos.create.recipient.label
source: Người nhận
en: Recipient

# kudos.create.recipient.noResults
source: Không tìm thấy kết quả
en: No results found

# kudos.create.recipient.placeholder
source: Tìm kiếm
en: Search

# kudos.create.standards.link
source: Tiêu chuẩn cộng đồng
en: Community standards

# kudos.create.title.hint
source: Ví dụ: Người truyền động lực cho tôi. Danh hiệu sẽ hiển thị làm tiêu đề Kudos của bạn.
en: E.g.: My biggest motivator. The title will appear as the Kudos heading.

# kudos.create.title.label
source: Danh hiệu
en: Title

# kudos.create.title.placeholder
source: Dành tặng một danh hiệu cho...
en: Give a recognition title to...

# kudos.create.toast.error.generic
source: Không thể gửi Kudos. Vui lòng thử lại.
en: Could not send Kudos. Please try again.

# kudos.create.toast.error.imagesUploading
source: Vui lòng đợi hình ảnh tải xong trước khi gửi.
en: Please wait for images to finish uploading.

# kudos.create.toast.error.network
source: Lỗi mạng. Vui lòng thử lại.
en: Network error. Please try again.

# kudos.create.toast.standards.coming
source: Tính năng sắp ra mắt
en: Coming soon

# kudos.create.toast.success
source: Đã gửi Kudos
en: Kudos sent

# kudos.detail.lightbox.close
source: Đóng
en: Close

# kudos.detail.profile.comingSoon
source: Trang hồ sơ đầy đủ sẽ ra mắt sớm.
en: Full profile page coming soon.

# kudos.detail.profile.title
source: Hồ sơ
en: Profile

# kudos.error.alreadyLiked
source: Bạn đã thả tim bài này rồi.
en: You already liked this Kudos.

# kudos.error.attachmentUploadFailed
source: Tải ảnh thất bại. Vui lòng thử lại.
en: Image upload failed. Please try again.

# kudos.error.cannotLikeOwnKudos
source: Bạn không thể tự thả tim bài của mình.
en: You can't like your own Kudos.

# kudos.error.createDenied
source: Không có quyền tạo Kudos.
en: You don't have permission to create this Kudos.

# kudos.error.imageTooLarge
source: Hình ảnh vượt quá 5MB.
en: Image exceeds 5MB.

# kudos.error.network
source: Không có kết nối. Thử lại sau.
en: No connection. Please retry.

# kudos.error.notAuthenticated
source: Phiên đã hết hạn.
en: Session expired.

# kudos.error.recipientSelfBlocked
source: Không thể gửi Kudos cho chính mình.
en: You cannot send a kudo to yourself.

# kudos.error.unknown
source: Có lỗi xảy ra.
en: Something went wrong.

# kudos.error.unsupportedImageType
source: Định dạng không được hỗ trợ (chỉ JPEG/PNG).
en: Unsupported format (JPEG/PNG only).

# kudos.filter.department
source: Phòng ban
en: Department

# kudos.hero.tagline
source: Hệ thống ghi nhận và cảm ơn
en: Recognition system

# kudos.list.empty
source: Hiện tại chưa có Kudos nào.
en: No Kudos yet.

# kudos.recipients.empty
source: Chưa có dữ liệu
en: No data yet.

# kudos.recipients.reward.saaShirt
source: 1 áo phông SAA
en: 1 SAA t-shirt

# kudos.recipients.row.receivedItem
source: Nhận được %@
en: Received %@

# kudos.recipients.title
source: 10 SUNNER NHẬN QUÀ MỚI NHẤT
en: 10 LATEST SUNNER GIFT RECIPIENTS

# kudos.retry
source: Thử lại
en: Retry

# kudos.secretBox.open
source: Mở Secret Box
en: Open Secret Box

# kudos.send.placeholder
source: Hôm nay, bạn muốn gửi kudos đến ai?
en: Who do you want to thank today?

# kudos.spotlight.comingSoon
source: Tính năng đang được phát triển
en: Coming soon

# kudos.spotlight.search.placeholder
source: Tìm kiếm
en: Search

# kudos.stats.boxesOpened
source: Số Secret Box bạn đã mở:
en: Secret Boxes opened:

# kudos.stats.boxesUnopened
source: Số Secret Box chưa mở:
en: Unopened Secret Boxes:

# kudos.stats.hearts
source: Số tim bạn nhận được:
en: Hearts received:

# kudos.stats.received
source: Số Kudos bạn nhận được:
en: Kudos received:

# kudos.stats.sent
source: Số Kudos bạn đã gửi:
en: Kudos sent:

# kudos.toast.comingSoon
source: Tính năng đang được phát triển
en: Coming soon

# kudos.toast.likeFailed
source: Không thể thực hiện, thử lại sau.
en: Couldn't apply. Try again.

# login.button.google
source: ĐĂNG NHẬP với Google
en: LOGIN With Google

# login.copyright
source: Bản quyền thuộc về Sun* © 2025
en: Copyright belongs to Sun* © 2025

# login.description
source: Bắt đầu hành trình của bạn cùng SAA 2025. Đăng nhập để khám phá!
en: Start your journey with SAA 2025. Log in to explore!

# login.error.network
source: Lỗi kết nối mạng
en: Network connection failed

# login.error.notAuthorized
source: Tài khoản không được phép truy cập
en: Account not authorized

# login.error.unknown
source: Đăng nhập thất bại. Vui lòng thử lại.
en: Login failed. Please try again.
